## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.rg-tf-db-ai-demo has been deleted
  - resource "azurerm_resource_group" "rg-tf-db-ai-demo" {
      - id         = "/subscriptions/04503e56-9444-4dec-9e6d-badea9220d71/resourceGroups/rg-tf-db-ai-demo" -> null
        name       = "rg-tf-db-ai-demo"
        tags       = {}
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg-tf-db-ai-demo will be created
  + resource "azurerm_resource_group" "rg-tf-db-ai-demo" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-tf-db-ai-demo"
    }

  # azurerm_role_definition.custom_role will be created
  + resource "azurerm_role_definition" "custom_role" {
      + assignable_scopes           = (known after apply)
      + description                 = "Custom role to allow role assignments"
      + id                          = (known after apply)
      + name                        = "Custom Role for Role Assignment"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = (known after apply)

      + permissions {
          + actions     = [
              + "Microsoft.Authorization/roleAssignments/write",
              + "Microsoft.Authorization/roleAssignments/read",
            ]
          + not_actions = []
        }
    }

  # module.databricks.azurerm_databricks_workspace.workspace will be created
  + resource "azurerm_databricks_workspace" "workspace" {
      + customer_managed_key_enabled      = false
      + disk_encryption_set_id            = (known after apply)
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + location                          = "uksouth"
      + managed_disk_identity             = (known after apply)
      + managed_resource_group_id         = (known after apply)
      + managed_resource_group_name       = "db-managed-rg-demo"
      + name                              = "db-workspace-demo"
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-tf-db-ai-demo"
      + sku                               = "trial"
      + storage_account_identity          = (known after apply)
      + tags                              = {
          + "Environment" = "Demo Sandbox"
          + "Pricing"     = "Trial SKU"
        }
      + workspace_id                      = (known after apply)
      + workspace_url                     = (known after apply)

      + custom_parameters {
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "pp-private-subnet"
          + private_subnet_network_security_group_association_id = (known after apply)
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "pp-public-subnet"
          + public_subnet_network_security_group_association_id  = (known after apply)
          + storage_account_name                                 = "sadatabricksppdemo"
          + storage_account_sku_name                             = "Standard_LRS"
          + virtual_network_id                                   = (known after apply)
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.databricks.azurerm_network_security_group.example will be created
  + resource "azurerm_network_security_group" "example" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pp-databricks-nsg"
      + resource_group_name = "rg-tf-db-ai-demo"
      + security_rule       = (known after apply)
    }

  # module.databricks.azurerm_subnet.private will be created
  + resource "azurerm_subnet" "private" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "pp-private-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-tf-db-ai-demo"
      + virtual_network_name                          = "pp-databricks-vnet"

      + delegation {
          + name = "pp-databricks-del"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.databricks.azurerm_subnet.public will be created
  + resource "azurerm_subnet" "public" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "pp-public-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-tf-db-ai-demo"
      + virtual_network_name                          = "pp-databricks-vnet"

      + delegation {
          + name = "pp-databricks-del"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.databricks.azurerm_subnet_network_security_group_association.private will be created
  + resource "azurerm_subnet_network_security_group_association" "private" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.databricks.azurerm_subnet_network_security_group_association.public will be created
  + resource "azurerm_subnet_network_security_group_association" "public" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.databricks.azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pp-databricks-vnet"
      + resource_group_name = "rg-tf-db-ai-demo"
      + subnet              = (known after apply)
    }

  # module.databricks.databricks_user.user will be created
  + resource "databricks_user" "user" {
      + acl_principal_id           = (known after apply)
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + disable_as_user_deletion   = (known after apply)
      + display_name               = "PP-Test User"
      + home                       = (known after apply)
      + id                         = (known after apply)
      + repos                      = (known after apply)
      + user_name                  = "pp-test-user@databricks.com"
      + workspace_access           = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_id = (known after apply)
  + public_subnet_id  = (known after apply)
```
</details>